---
type: FamilyUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FamilyUtils

`Autodesk.Revit.DB.FamilyUtils` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ConvertFamilyToFaceHostBased | — | `public static void ConvertFamilyToFaceHostBased ( Document document , ElementId familyId )` |
| Method | FamilyCanConvertToFaceHostBased | — | `public static bool FamilyCanConvertToFaceHostBased ( Document document , ElementId familyId )` |
| Method | GetProfileSymbols | 2014 | `public static ICollection < ElementId > GetProfileSymbols ( Document document , ProfileFamilyUsage profileFamilyUsage , bool oneCurveLoopOnly )` |